#pragma once

class Map
{
public:
	////////////////////////
	//--------関数--------//
	////////////////////////
	//コンストラクタ
	Map();
	//デストラクタ
	~Map();
	//初期化
	void Init();
	//描画
	void Draw();
private:
	////////////////////////
	//--------変数--------//
	////////////////////////
	int gymModel;		//体育館のモデル

	////////////////////////
	//--------定数--------//
	////////////////////////
	const VECTOR GymPosition = VGet(0, 0, 0);					//体育館の初期座標
	const VECTOR GymScale = VGet(0.015f, 0.015f, 0.015f);		//体育館の拡大率
};

